In [40]:
import numpy as np
import pandas as pd
import json
import csv

In [11]:
dates=pd.date_range('1-12-1997',periods=7)
ts=pd.Series(np.arange(7),index=dates)
ts.to_csv('dates.csv')
print(pd.read_csv('dates.csv'))

   1997-01-12  0
0  1997-01-13  1
1  1997-01-14  2
2  1997-01-15  3
3  1997-01-16  4
4  1997-01-17  5
5  1997-01-18  6

C:\Users\ASIF_PC\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  This is separate from the ipykernel package so we can avoid doing imports until

In [17]:
obj = """{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38,"pets": ["Sixes", "Stache", "Cisco"]}]}"""
with open('jdata.json','w') as f:
    json.dump(obj,f)

In [23]:
with open('jdata.json','r')as r:
     data = json.load(r)
print(data)

{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38,"pets": ["Sixes", "Stache", "Cisco"]}]}

In [5]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile
#pd.read_clipboard()
#pd.read_excel('train')

# XML and HTML: Web Scraping

In [6]:
import lxml
tables = pd.read_html('file:///C:/Users/ASIF_PC/Desktop/Python/2nd%20Quater/Practice_Q2/fdic_failed_bank_list.html')
f=tables[0]

In [7]:
print(f.columns)
f['Closing Date'].head()

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

0    September 23, 2016
1       August 19, 2016
2           May 6, 2016
3        April 29, 2016
4        March 11, 2016
Name: Closing Date, dtype: object

In [8]:
pd.to_datetime(f['Closing Date'].head())

0   2016-09-23
1   2016-08-19
2   2016-05-06
3   2016-04-29
4   2016-03-11
Name: Closing Date, dtype: datetime64[ns]

In [9]:
close_timestamps = pd.to_datetime(f['Closing Date'])

close_timestamps.dt.date.value_counts().head()

2009-10-30    9
2010-08-20    8
2010-04-16    8
2009-07-24    7
2009-10-23    7
Name: Closing Date, dtype: int64

In [22]:
l=[]
#close_timestamps.dt.month.value_counts().head()
#close_timestamps.dt.dayofweek.value_counts()
l.append(close_timestamps.dt.month.value_counts())
l.append(close_timestamps.dt.year.value_counts())
s=zip(close_timestamps.dt.year.value_counts(),close_timestamps.dt.month.value_counts())
for i in s:
    print(i)

(157, 74)
(140, 58)
(92, 58)
(51, 49)
(25, 44)
(24, 41)
(18, 41)
(11, 39)
(8, 38)
(5, 36)
(4, 35)
(4, 34)

In [30]:
close_timestamps.dt.day_name().value_counts()

Friday       522
Thursday      19
Wednesday      2
Tuesday        2
Saturday       1
Monday         1
Name: Closing Date, dtype: int64

In [38]:
close_timestamps.dt.is_leap_year.value_counts()

False    460
True      87
Name: Closing Date, dtype: int64

# PICKLE

In [6]:
bn=pd.read_csv('mydata.csv')
bn.to_pickle('mydata.csv')
pd.read_pickle('mydata.csv')

   one  two  three
0    1    2      3
1    4    5      6
2    7    8      9

In [20]:
from lxml import objectify
from io import StringIO 
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()
#root.text
#root.get('href')

'ppp'

# HDF5

In [9]:
import  numpy as np
fm=pd.DataFrame({'a':np.arange(6),'b':np.arange(6)})

hdf=pd.HDFStore('hdata.h5')

hdf['A_co']=fm['b']
hdf['B_co']=fm['a']
fm

   a  b
0  0  0
1  1  1
2  2  2
3  3  3
4  4  4
5  5  5

In [10]:
hdf['B_co']

0    0
1    1
2    2
3    3
4    4
5    5
Name: a, dtype: int32

In [43]:
hdf.put('COLUMN',fm,format='table')
hdf.select('COLUMN',where=['index<=3'])

   a  b
0  0  0
1  1  1
2  2  2
3  3  3

In [51]:
fm.to_hdf('hdf2','C_1',format='table')
pd.read_hdf('hdf2',where=['index>2'])

   a  b
3  3  3
4  4  4
5  5  5

# EXCEL

In [75]:
#r=pd.ExcelFile('file.xls')
r=pd.read_excel('file.xls')
r['EG']=np.arange(9)
r

,SNO,XL,XU,F(XL),F(XU),XM,F(XM),F(XL).F(XM),EG
0,1,1.000000,2.000000,-1.000000,2.000000,1.500000,0.250000,-0.250000,0
1,2,1.000000,1.500000,-1.000000,0.250000,1.250000,-0.437500,0.437500,1
2,3,1.250000,1.500000,-0.437500,0.250000,1.375000,-0.109375,0.047852,2
3,4,1.375000,1.500000,-0.109375,0.250000,1.437500,0.066406,-0.007263,3
4,5,1.375000,1.437500,-0.109375,0.066406,1.406250,-0.022461,0.002457,4
5,6,1.406250,1.437500,-0.022461,0.066406,1.421875,0.021729,-0.000488,5
6,7,1.406250,1.421875,-0.022461,0.021729,1.414062,-0.000427,0.000010,6
7,8,1.414062,1.421875,-0.000427,0.021729,1.417969,0.010635,-0.000005,7
8,9,1.414062,1.417969,-0.000427,0.010635,1.416016,0.005100,-0.000002,8

In [77]:
r.to_excel('file2.xls')
r

,SNO,XL,XU,F(XL),F(XU),XM,F(XM),F(XL).F(XM),EG
0,1,1.000000,2.000000,-1.000000,2.000000,1.500000,0.250000,-0.250000,0
1,2,1.000000,1.500000,-1.000000,0.250000,1.250000,-0.437500,0.437500,1
2,3,1.250000,1.500000,-0.437500,0.250000,1.375000,-0.109375,0.047852,2
3,4,1.375000,1.500000,-0.109375,0.250000,1.437500,0.066406,-0.007263,3
4,5,1.375000,1.437500,-0.109375,0.066406,1.406250,-0.022461,0.002457,4
5,6,1.406250,1.437500,-0.022461,0.066406,1.421875,0.021729,-0.000488,5
6,7,1.406250,1.421875,-0.022461,0.021729,1.414062,-0.000427,0.000010,6
7,8,1.414062,1.421875,-0.000427,0.021729,1.417969,0.010635,-0.000005,7
8,9,1.414062,1.417969,-0.000427,0.010635,1.416016,0.005100,-0.000002,8